In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [6]:
ipl_match_stats = pd.read_csv("IPL_Matches_2008_2021.csv")
ipl_match_stats.head(10)

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,SuperOver,WinningTeam,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2
0,1254117,Dubai,2021-10-15,2021,Final,Chennai Super Kings,Kolkata Knight Riders,Dubai International Cricket Stadium,Kolkata Knight Riders,field,N,Chennai Super Kings,Runs,27.0,NaN,F du Plessis,"['RD Gaikwad', 'F du Plessis', 'RV Uthappa', '...","['Shubman Gill', 'VR Iyer', 'N Rana', 'SP Nari...",Nitin Menon,RK Illingworth
1,1254116,Sharjah,2021-10-13,2021,Qualifier 2,Delhi Capitals,Kolkata Knight Riders,Sharjah Cricket Stadium,Kolkata Knight Riders,field,N,Kolkata Knight Riders,Wickets,3.0,NaN,VR Iyer,"['PP Shaw', 'S Dhawan', 'MP Stoinis', 'SS Iyer...","['Shubman Gill', 'VR Iyer', 'N Rana', 'RA Trip...",KN Ananthapadmanabhan,MA Gough
2,1254115,Sharjah,2021-10-11,2021,Eliminator,Royal Challengers Bangalore,Kolkata Knight Riders,Sharjah Cricket Stadium,Royal Challengers Bangalore,bat,N,Kolkata Knight Riders,Wickets,4.0,NaN,SP Narine,"['D Padikkal', 'V Kohli', 'KS Bharat', 'GJ Max...","['Shubman Gill', 'VR Iyer', 'RA Tripathi', 'N ...",CB Gaffaney,VK Sharma
3,1254114,Dubai,2021-10-10,2021,Qualifier 1,Delhi Capitals,Chennai Super Kings,Dubai International Cricket Stadium,Chennai Super Kings,field,N,Chennai Super Kings,Wickets,4.0,NaN,RD Gaikwad,"['PP Shaw', 'S Dhawan', 'SS Iyer', 'AR Patel',...","['RD Gaikwad', 'F du Plessis', 'RV Uthappa', '...",Nitin Menon,RK Illingworth
4,1254088,Abu Dhabi,2021-10-08,2021,55,Mumbai Indians,Sunrisers Hyderabad,"Zayed Cricket Stadium, Abu Dhabi",Mumbai Indians,bat,N,Mumbai Indians,Runs,42.0,NaN,Ishan Kishan,"['RG Sharma', 'Ishan Kishan', 'HH Pandya', 'KA...","['JJ Roy', 'Abhishek Sharma', 'MK Pandey', 'Mo...",Tapan Sharma,VK Sharma
5,1254101,Dubai,2021-10-08,2021,56,Delhi Capitals,Royal Challengers Bangalore,Dubai International Cricket Stadium,Royal Challengers Bangalore,field,N,Royal Challengers Bangalore,Wickets,7.0,NaN,KS Bharat,"['PP Shaw', 'S Dhawan', 'RR Pant', 'SS Iyer', ...","['V Kohli', 'D Padikkal', 'KS Bharat', 'AB de ...",KN Ananthapadmanabhan,Nitin Menon
6,1254106,Sharjah,2021-10-07,2021,54,Kolkata Knight Riders,Rajasthan Royals,Sharjah Cricket Stadium,Rajasthan Royals,field,N,Kolkata Knight Riders,Runs,86.0,NaN,Shivam Mavi,"['Shubman Gill', 'VR Iyer', 'N Rana', 'RA Trip...","['YBK Jaiswal', 'LS Livingstone', 'SV Samson',...",MA Gough,HAS Khalid
7,1254094,Dubai,2021-10-07,2021,53,Chennai Super Kings,Punjab Kings,Dubai International Cricket Stadium,Punjab Kings,field,N,Punjab Kings,Wickets,6.0,NaN,KL Rahul,"['RD Gaikwad', 'F du Plessis', 'MM Ali', 'RV U...","['KL Rahul', 'MA Agarwal', 'SN Khan', 'M Shahr...",K Srinivasan,RK Illingworth
8,1254095,Abu Dhabi,2021-10-06,2021,52,Sunrisers Hyderabad,Royal Challengers Bangalore,"Zayed Cricket Stadium, Abu Dhabi",Royal Challengers Bangalore,field,N,Sunrisers Hyderabad,Runs,4.0,NaN,KS Williamson,"['JJ Roy', 'Abhishek Sharma', 'KS Williamson',...","['V Kohli', 'D Padikkal', 'DT Christian', 'KS ...",S Ravi,UV Gandhe
9,1254093,Sharjah,2021-10-05,2021,51,Rajasthan Royals,Mumbai Indians,Sharjah Cricket Stadium,Mumbai Indians,field,N,Mumbai Indians,Wickets,8.0,NaN,NM Coulter-Nile,"['E Lewis', 'YBK Jaiswal', 'SV Samson', 'S Dub...","['RG Sharma', 'Ishan Kishan', 'SA Yadav', 'HH ...",AK Chaudhary,MA Gough

In [7]:
#removing unnecessary columns
ipl_match_stats = ipl_match_stats.drop(["Team1Players","Team2Players","Umpire1","Umpire2"], axis = 1)

In [8]:
ipl_match_stats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 876 entries, 0 to 875
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               876 non-null    int64
 1   City             825 non-null    object
 2   Date             876 non-null    object
 3   Season           876 non-null    object
 4   MatchNumber      876 non-null    object
 5   Team1            876 non-null    object
 6   Team2            876 non-null    object
 7   Venue            876 non-null    object
 8   TossWinner       876 non-null    object
 9   TossDecision     876 non-null    object
 10  SuperOver        872 non-null    object
 11  WinningTeam      872 non-null    object
 12  WonBy            876 non-null    object
 13  Margin           858 non-null    float64
 14  method           19 non-null     object
 15  Player_of_Match  872 non-null    object
dtypes: float64(1), int64(1), object(14)
memory usage: 109.6+ KB

In [9]:
#from above result, it is evident that four matches did not have results. we can delete those rows as they are unnecessary
ipl_match_stats[(ipl_match_stats["WonBy"]=="NoResults") & (ipl_match_stats["Player_of_Match"].isnull())]

#drop the rows with null values
ipl_match_stats = ipl_match_stats.drop(ipl_match_stats[ipl_match_stats.WonBy =="NoResults"].index)

In [10]:
ipl_match_stats.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 872 entries, 0 to 875
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               872 non-null    int64
 1   City             821 non-null    object
 2   Date             872 non-null    object
 3   Season           872 non-null    object
 4   MatchNumber      872 non-null    object
 5   Team1            872 non-null    object
 6   Team2            872 non-null    object
 7   Venue            872 non-null    object
 8   TossWinner       872 non-null    object
 9   TossDecision     872 non-null    object
 10  SuperOver        872 non-null    object
 11  WinningTeam      872 non-null    object
 12  WonBy            872 non-null    object
 13  Margin           858 non-null    float64
 14  method           19 non-null     object
 15  Player_of_Match  872 non-null    object
dtypes: float64(1), int64(1), object(14)
memory usage: 115.8+ KB

In [11]:
#import ball_by_ball stats csv
ipl_bb = pd.read_csv("IPL_Ball_by_Ball_2008_2021.csv")

In [12]:
    ipl_bb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208042 entries, 0 to 208041
Data columns (total 17 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   ID                 208042 non-null  int64
 1   innings            208042 non-null  int64
 2   overs              208042 non-null  int64
 3   ballnumber         208042 non-null  int64
 4   batter             208042 non-null  object
 5   bowler             208042 non-null  object
 6   non-striker        208042 non-null  object
 7   extra_type         10999 non-null   object
 8   batsman_run        208042 non-null  int64
 9   extras_run         208042 non-null  int64
 10  total_run          208042 non-null  int64
 11  non_boundary       208042 non-null  int64
 12  isWicketDelivery   208042 non-null  int64
 13  player_out         10239 non-null   object
 14  kind               10239 non-null   object
 15  fielders_involved  7284 non-null    object
 16  BattingTeam        208042 non-null  object
dtypes: int64(9), object(8)
memory usage: 27.0+ MB

In [13]:
#check the number of balls played by a batter
#we are creating the resultset as a separate dataset by itself
balls_faced = pd.DataFrame(ipl_bb.groupby(['batter']).size(), columns = ["balls_faced"])
balls_faced = balls_faced.reset_index()

In [14]:
balls_faced.head(10)

           batter  balls_faced
0  A Ashish Reddy          196
1      A Chandila            7
2        A Chopra           75
3     A Choudhary           20
4     A Dananjaya            5
5      A Flintoff           57
6        A Kumble           49
7        A Mishra          410
8        A Mithun           26
9        A Mukund           23

In [115]:
#runs scored by each batsman
runs = pd.DataFrame(ipl_bb.groupby(['batter','batsman_run']).size(), columns = ["runs_scored"])
runs = runs.reset_index()
runs = runs.drop(runs[runs.batsman_run == 0].index)
runs.head(10)

            batter  batsman_run  runs_scored
1   A Ashish Reddy            1           83
2   A Ashish Reddy            2           20
3   A Ashish Reddy            3            1
4   A Ashish Reddy            4           16
5   A Ashish Reddy            6           15
7       A Chandila            1            4
9         A Chopra            1           21
10        A Chopra            2            2
11        A Chopra            4            7
13     A Choudhary            1           13

In [116]:
#total runs = runs per ball * number of times
runs["total"] = runs["batsman_run"]*runs["runs_scored"]
runs.head(10)

            batter  batsman_run  runs_scored  total
1   A Ashish Reddy            1           83     83
2   A Ashish Reddy            2           20     40
3   A Ashish Reddy            3            1      3
4   A Ashish Reddy            4           16     64
5   A Ashish Reddy            6           15     90
7       A Chandila            1            4      4
9         A Chopra            1           21     21
10        A Chopra            2            2      4
11        A Chopra            4            7     28
13     A Choudhary            1           13     13

In [117]:
#drop unnecessary columns
runs = runs.drop(["batsman_run","runs_scored"], axis = 1)
runs

              batter  total
1     A Ashish Reddy     83
2     A Ashish Reddy     40
3     A Ashish Reddy      3
4     A Ashish Reddy     64
5     A Ashish Reddy     90
...              ...    ...
2565    Yuvraj Singh    894
2567          Z Khan     47
2568          Z Khan     14
2569          Z Khan     44
2570          Z Khan     12

[2016 rows x 2 columns]

In [118]:
runs_scored = pd.DataFrame(runs.groupby(['batter']).sum())
runs_scored = runs_scored.reset_index()
runs_scored

                total
batter
A Ashish Reddy    280
A Chandila          4
A Chopra           53
A Choudhary        25
A Dananjaya         4
...               ...
YV Takawale       192
Yashpal Singh      47
Younis Khan         3
Yuvraj Singh     2754
Z Khan            117

[542 rows x 1 columns]

In [18]:
#check the number of balls bowled by a bowler
#we are creating the resultset as a separate dataset by itself
balls_bowled = pd.DataFrame(ipl_bb.groupby(['bowler']).size(), columns = ["balls_bowled"])
balls_bowled = balls_bowled.reset_index()

In [19]:
balls_bowled.head(10)

           bowler  balls_bowled
0  A Ashish Reddy           270
1      A Chandila           234
2     A Choudhary           108
3     A Dananjaya            25
4      A Flintoff            66
5        A Kumble           983
6        A Mishra          3317
7        A Mithun           312
8         A Nehra          1974
9           A Nel            18

In [20]:
#groupby the data by bowler name and count the number of 0's and 1's in the isWicketDelivery column
wickets = pd.DataFrame(ipl_bb.groupby(['bowler','isWicketDelivery']).size(), columns = ["wickets_taken"])

wickets.head(10)

                                 wickets_taken
bowler         isWicketDelivery
A Ashish Reddy 0                           251
               1                            19
A Chandila     0                           223
               1                            11
A Choudhary    0                           103
               1                             5
A Dananjaya    0                            25
A Flintoff     0                            64
               1                             2
A Kumble       0                           934

In [21]:
#reset the index of new dataframe, to perform operations
wickets = wickets.reset_index()

In [22]:
#we dont need the rows which have isWicketDelivery = 0, hence remove them
wickets = wickets.drop(wickets[wickets.isWicketDelivery == 0].index)

In [23]:
wickets.head(10)

            bowler  isWicketDelivery  wickets_taken
1   A Ashish Reddy                 1             19
3       A Chandila                 1             11
5      A Choudhary                 1              5
8       A Flintoff                 1              2
10        A Kumble                 1             49
12        A Mishra                 1            175
14        A Mithun                 1              8
16         A Nehra                 1            121
18           A Nel                 1              1
20        A Nortje                 1             35

In [24]:
#remove the isWicketDelivery column as it is unnecessary
wickets = wickets.drop("isWicketDelivery", axis = 1)

In [27]:
wickets.head(10)

            bowler  wickets_taken
1   A Ashish Reddy             19
3       A Chandila             11
5      A Choudhary              5
8       A Flintoff              2
10        A Kumble             49
12        A Mishra            175
14        A Mithun              8
16         A Nehra            121
18           A Nel              1
20        A Nortje             35

In [99]:
#runs scored by each batsman
runs = pd.DataFrame(ipl_bb.groupby(['batter','batsman_run']).size(), columns = ["runs_scored"])
runs = runs.reset_index()
runs = runs.drop(runs[runs.batsman_run == 0].index)
runs.head(10)

            batter  batsman_run  runs_scored
1   A Ashish Reddy            1           83
2   A Ashish Reddy            2           20
3   A Ashish Reddy            3            1
4   A Ashish Reddy            4           16
5   A Ashish Reddy            6           15
7       A Chandila            1            4
9         A Chopra            1           21
10        A Chopra            2            2
11        A Chopra            4            7
13     A Choudhary            1           13

In [100]:
runs.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2016 entries, 1 to 2570
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   batter       2016 non-null   object
 1   batsman_run  2016 non-null   int64
 2   runs_scored  2016 non-null   int64
dtypes: int64(2), object(1)
memory usage: 63.0+ KB

In [101]:
runs["total"] = runs["batsman_run"]*runs["runs_scored"]
runs.head(10)

            batter  batsman_run  runs_scored  total
1   A Ashish Reddy            1           83     83
2   A Ashish Reddy            2           20     40
3   A Ashish Reddy            3            1      3
4   A Ashish Reddy            4           16     64
5   A Ashish Reddy            6           15     90
7       A Chandila            1            4      4
9         A Chopra            1           21     21
10        A Chopra            2            2      4
11        A Chopra            4            7     28
13     A Choudhary            1           13     13

In [104]:
#drop unnecessary columns
runs = runs.drop(["batsman_run","runs_scored"], axis = 1)
runs

              batter  total
1     A Ashish Reddy     83
2     A Ashish Reddy     40
3     A Ashish Reddy      3
4     A Ashish Reddy     64
5     A Ashish Reddy     90
...              ...    ...
2565    Yuvraj Singh    894
2567          Z Khan     47
2568          Z Khan     14
2569          Z Khan     44
2570          Z Khan     12

[2016 rows x 2 columns]